jeacelo/CC3200-IoT/main.c
	            json_printf(&out1,"{ boton : %B}",true);

	                                sl_ExtLib_MqttClientSend((void*)local_con_conf[iCount].clt_ctx,
	                                                    pub_topic_json,json_buffer,strlen((char*)json_buffer),QOS2,RETAIN);


	            UART_PRINT("\n\r CC3200 Publishes the following message \n\r");
	            UART_PRINT("Topic: %s\n\r",pub_topic_sw3);
	            UART_PRINT("Data: %s\n\r",data_sw3);
	        }
	        else if(BROKER_DISCONNECTION == RecvQue)
	        {
	            iConnBroker--;
	            if(iConnBroker < 1)
	            {
	                //
	                // device not connected to any broker
	                //
	                goto end;
	            }
	        }
	    }
	end:
	    //
	    // Deinitializating the client library
	    //
	    sl_ExtLib_MqttClientExit();
	    UART_PRINT("\n\r Exiting the Application\n\r");

	    //LOOP_FOREVER();
	    //Kill the task
	    OsiTaskHandle handle=NULL;
	    osi_TaskDelete(&handle);


}
#endif





//*****************************************************************************
//
//! Task implementing MQTT client communication to other web client through
//!    a broker
//!
//! \param  none
//!
//! This function
//!    1. Initializes network driver and connects to the default AP
//!    2. Initializes the mqtt library and set up MQTT connection configurations
//!    3. set up the button events and their callbacks(for publishing)
//!    4. handles the callback signals
//!
//! \return None
//!
//*****************************************************************************
void ConnectWiFI(void *pvParameters)
{
    
    long lRetVal = -1;
#ifdef STATION_MODE
    //These are only used in that mode
    int iCount = 0;
    int iNumBroker = 0;
    int iConnBroker = 0;
    osi_messages RecvQue;
    connect_config *local_con_conf = (connect_config *)app_hndl;
#endif
    //
    // Configure LED
    //
    GPIO_IF_LedConfigure(LED1|LED2|LED3);

    GPIO_IF_LedOff(MCU_RED_LED_GPIO);
    GPIO_IF_LedOff(MCU_GREEN_LED_GPIO);

    //
    // Reset The state of the machine
    //
    Network_IF_ResetMCUStateMachine();

    //
    // Start the driver
    //
#ifdef STATION_MODE
    lRetVal = Network_IF_InitDriver(ROLE_STA);
    if(lRetVal < 0)
    {
       UART_PRINT("Failed to start SimpleLink Device\n\r",lRetVal);
       LOOP_FOREVER();
    }

    // switch on Green LED to indicate Simplelink is properly up
    GPIO_IF_LedOn(MCU_ON_IND);

    // Start Timer to blink Red LED till AP connection
    LedTimerConfigNStart();

    // Initialize AP security params
    SecurityParams.Key = (signed char *)SECURITY_KEY;
    SecurityParams.KeyLen = strlen(SECURITY_KEY);
    SecurityParams.Type = SECURITY_TYPE;

    //
    // Connect to the Access Point
    //
    lRetVal = Network_IF_ConnectAP(SSID_NAME, SecurityParams);
    if(lRetVal < 0)
    {
       UART_PRINT("Connection to an AP failed\n\r");
       LOOP_FOREVER();
    }
#else
    lRetVal = Network_IF_InitDriver(ROLE_AP);
    if (lRetVal<0)
    	LOOP_FOREVER();

    // switch on Green LED to indicate Simplelink is properly up
    GPIO_IF_LedOn(MCU_ON_IND);

    // Start Timer to blink Red LED
    LedTimerConfigNStart();

    lRetVal=sl_WlanSet(SL_WLAN_CFG_AP_ID, WLAN_AP_OPT_SSID, strlen(SSID_NAME), SSID_NAME); //Configura el SSID en modo AP...
    if (lRetVal<0)
        	LOOP_FOREVER();

    uint8_t secType=SECURITY_TYPE;
    lRetVal = sl_WlanSet(SL_WLAN_CFG_AP_ID,
    		WLAN_AP_OPT_SECURITY_TYPE, 1,
			(unsigned char *)&secType);
    if (lRetVal<0) ERR_PRINT( lRetVal);

    lRetVal = sl_WlanSet(SL_WLAN_CFG_AP_ID,
    		WLAN_AP_OPT_PASSWORD,
			strlen((const char *)SECURITY_KEY),
			(unsigned char *)SECURITY_KEY);
    if (lRetVal<0) ERR_PRINT( lRetVal);

    //Restart the network after changing access point name....
    lRetVal = sl_Stop(0xFF);
    if (lRetVal<0) ERR_PRINT( lRetVal);
    lRetVal = sl_Start(0, 0, 0);
    if (lRetVal<0) ERR_PRINT( lRetVal);

#endif

    //
    // Disable the LED blinking Timer as Device is connected to AP
    //
    LedTimerDeinitStop();

    //
    // Switch ON RED LED to indicate that Device acquired an IP
    //
    GPIO_IF_LedOn(MCU_IP_ALLOC_IND);

    //UtilsDelay(20000000);
    osi_Sleep(1000); //JMCG mas elegante una espera de RTOS

    GPIO_IF_LedOff(MCU_RED_LED_GPIO);
    GPIO_IF_LedOff(MCU_ORANGE_LED_GPIO);
    GPIO_IF_LedOff(MCU_GREEN_LED_GPIO);


    //
    // Inicializa la biblioteca que gestiona el bus I2C. (movido desde main(...))
    //
    if(I2C_IF_Open(I2C_MASTER_MODE_FST) < 0)
    {
   	 while (1);
    }

    osi_Sleep(10); //Espera un poco


    //Esto tiene que ser realizado en una tarea. De momento lo pongo aqui
    //Init Temperature Sensor
    if(TMP006DrvOpen() < 0)
    {
    	UARTprintf("TMP006 open error\n");
    }

    //Esto tiene que ser realizado en una tarea. De momento lo pongo aqui
    //Init Accelerometer Sensor
    if(BMA222Open() < 0)
    {
    	UARTprintf("BMA222 open error\n");
    }


    osi_Sleep(10); //Espera un poco

    //
    // Vuelve a poner los pines como salida GPIO
    // No deberia hacerlo mientras haya una transferencia I2C activa.
    MAP_PinTypeGPIO(PIN_01, PIN_MODE_0, false);
    MAP_GPIODirModeSet(GPIOA1_BASE, 0x4, GPIO_DIR_MODE_OUT);
    MAP_PinTypeGPIO(PIN_02, PIN_MODE_0, false);
    MAP_GPIODirModeSet(GPIOA1_BASE, 0x8, GPIO_DIR_MODE_OUT);

    //HAbilitamos los timers en modo PWM (pero NO habilitamos los pines como PWM)
    PWM_IF_Init(0);


    //
    // Display Application Banner
    //
    DisplayBanner("MQTT_Client");
   
    //
    // Register Push Button Handlers
    //
    Button_IF_Init(pushButtonInterruptHandler2,pushButtonInterruptHandler3);
    
    //Lanza el interprete de comandos...
    lRetVal = osi_TaskCreate(vUARTTask,
                        (const signed char *)"CmdLine",
                        OSI_STACK_SIZE, NULL, 2, NULL );

	if(lRetVal < 0)
	{
    	ERR_PRINT(lRetVal);
    	LOOP_FOREVER();
	}


#ifdef STATION_MODE
    //
    // Initialze MQTT client lib
    //
    lRetVal = sl_ExtLib_MqttClientInit(&Mqtt_Client);
    if(lRetVal != 0)
    {
        // lib initialization failed
        UART_PRINT("MQTT Client lib initialization failed\n\r");
        LOOP_FOREVER();
    }
    
    /******************* connection to the broker ***************************/
    iNumBroker = sizeof(usr_connect_config)/sizeof(connect_config);
    if(iNumBroker > MAX_BROKER_CONN)
    {
        UART_PRINT("Num of brokers are more then max num of brokers\n\r");
        LOOP_FOREVER();
    }

