jeacelo/CC3200-IoT/main.c
    LOOP_FOREVER();


#else


    //Antes de salir, crea la tarea que genera el patron
    // PodrÌa hacerlo en otro sitio, por ejemplo un comando.
	//lRetVal = osi_TaskCreate(ColorLedTask,
	//                        (const signed char *)"ColorLeds",
	//                        OSI_STACK_SIZE, NULL, 2, NULL );

	if(lRetVal < 0)
	{
	   	ERR_PRINT(lRetVal);
	   	LOOP_FOREVER();
	}




    //Cambiar....> Ahora la parque que se intenta conectar, se har√≠a en el interprete de comandos...
    //Se tendria que lanzar una tarea adicional
    OsiTaskHandle handle=NULL;
    osi_TaskDelete(&handle);

#endif
}





//}

//*****************************************************************************
//
//! Main 
//!
//! \param  none
//!
//! This function
//!    1. Invokes the SLHost task
//!    2. Invokes the ConnectWiFI
//!
//! \return None
//!
//*****************************************************************************



void main()
{ 
    long lRetVal = -1;

    //
    // Initialize the board configurations
    //
    BoardInit();

    //
    // Pinmux for UART
    //
    PinMuxConfig();

    //
    // Configuring UART
    //
    InitTerm();

    InitRGBSPI();
    WSArrayInit(pui8SPIOut, sizeof(pui8SPIOut));
    InitSPITransfer((uint8_t*)pui8SPIOut, sizeof(pui8SPIOut));

    //
	// Start the SimpleLink Host
    //
    lRetVal = VStartSimpleLinkSpawnTask(SPAWN_TASK_PRIORITY);
    if(lRetVal < 0)
    {
        ERR_PRINT(lRetVal);
        LOOP_FOREVER();
    }

    //
    // Start the MQTT Client task
    //
    osi_MsgQCreate(&g_PBQueue,"PBQueue",sizeof(osi_messages),10);
    lRetVal = osi_TaskCreate(ConnectWiFI,
                            (const signed char *)"WifiApp",
                            OSI_STACK_SIZE, NULL, 2, NULL );

    if(lRetVal < 0)
    {
        ERR_PRINT(lRetVal);
        LOOP_FOREVER();
    }


    //
    // Start the task scheduler
    //
    osi_start();
}

